[
  {
    "Timestamp": "1/26/2026 1:22:13",
    "Email Address": "jadamadamilola@gmail.com",
    "Enter Full Name": "Jadama oluwadamilola Miracle",
    "Medical Qualification & Specialty": "Neurology",
    "Years of Clinical Experience": "7 years",
    "Hospital/Institution": "University teaching hospital Ibadan",
    "Consent-Confirmation": "I confirm that the information I provide can be used for a research-based health information system.",
    "What is malaria?": "Malaria is a parasitic infectious disease caused by protozoa of the genus Plasmodium. It is transmitted to humans through the bite of an infected female Anopheles mosquito, which introduces the parasite into the bloodstream.",
    "What causes malaria? (Brief explanation)": "Malaria is caused by protozoan parasites of the genus Plasmodium, which are transmitted to humans through the bite of an infected female Anopheles mosquito. The mosquito introduces the parasite into the bloodstream during feeding, allowing it to infect the liver and subsequently red blood cells, leading to the disease.",
    "How is malaria transmitted?": "Malaria is transmitted through the bite of an infected female Anopheles mosquito, which injects Plasmodium parasites into the human bloodstream during a blood meal.",
    "Common misconceptions about malaria you think users need to know": "- Malaria is caused by dirty water or poor hygiene\n- Malaria spreads through person-to-person contact\n- Every fever is malaria\n- Malaria is a mild illness\n- Malaria cannot return after treatment\n- Only children get malaria\n- Herbal remedies alone can cure malaria",
    "List the major symptoms of malaria.": "- Fever\n- Chills and rigors\n- Profuse sweating\n- Headache\n- Fatigue and generalized weakness\n- Muscle and joint pains\n- Nausea and vomiting",
    "List early/mild symptoms people usually ignore.": "- Low-grade fever\n- Headache\n- Fatigue\n- Muscle or joint discomfort\n- Loss of appetite\n- Nausea\n- Mild chills",
    "Select the Symptoms Related to General Symtomps and If all is Related Select all": "Pain-Related Symptoms, Fever Temperature Changes, Fatigue & Energy-Related Symptoms, Weight & Metabolic Changes",
    "A1. Pain-Related Symptoms (Please Select all that apply):": "Head Pain, Body Pain",
    "A1a. Head Pain-Related Symptoms (Please Select all that apply):": "Headache",
    "A1b. Body Pain-Related Symptoms (Please Select all that apply):": "Muscle pain (myalgia), Joint pain (arthralgia), Back pain",
    "A1c. Chest & Abdominal Pain-Related Symptoms (Please Select all that apply):": "Nausea/vomiting",
    "A2. Fever & Temperature Changes (Please Select all that apply):": "Fever, Temperature Sensitivity",
    "A2a. Fever Symptoms  (Please Select all that apply):": "High fever",
    "A2b. Temperature Sensitivity Symptoms (Please Select all that apply):": "Chills",
    "A3. Fatigue & Energy-Related Symptoms (Please Select all that apply):": "General Fatigue",
    "A3a. General Fatigue Symptoms (Please Select all that apply):": "General Fatigue, Weakness, Exhaustion",
    "A3b. Sleep-Related Issues (Please Select all that apply):": "Insomnia, Unrefreshing sleep",
    "A4. Respiratory Symptoms (Please Select all that apply):": "Breathing Difficulties",
    "A4a. Breathing Difficulties Symptoms (Please Select all that apply):": "Shortness of breath, Rapid breathing",
    "A4b. Airway Symptoms (Please Select all that apply):": "Cough (dry or productive), Chest tightness",
    "A4c. Nasal Symptoms (Please Select all that apply):": "Sneezing",
    "A5. Gastrointestinal (Digestive) Symptoms (Please Select all that apply):": "Stomach Discomfort, Appetite Changes",
    "A5a. Stomach Discomfort Symptoms (Please Select all that apply):": "Nausea, Vomiting",
    "A5b. Bowel Changes Symptoms (Please Select all that apply):": "Diarrhea",
    "A5c. Appetite Changes Symptoms (Please Select all that apply):": "Loss of appetite",
    "A6. Neurological Symptoms (Please Select all that apply):": "Headache/Behavioural changes",
    "A6a. Sensory Changes Symptoms (Please Select all that apply):": "Dizziness, Lightheadedness",
    "A6b. Cognitive Changes Symptoms (Please Select all that apply):": "Difficulty concentrating",
    "A6c. Motor Issues Symptoms (Please Select all that apply):": "Tremors, Poor coordination",
    "A7. Skin, Hair & Nail Symptoms (Please Select all that apply):": "Skin Changes, Color Changes, Hair & Nails",
    "A7a. Skin Changes Symptoms (Please Select all that apply):": "Rashes",
    "A7b. Color Changes Symptoms (Please Select all that apply):": "Pale skin, Yellowing of skin (jaundice)",
    "A7c. Hair & Nail Symptoms (Please Select all that apply):": "Hair loss",
    "A8. Cardiovascular Symptoms (Please Select all that apply):": "Heart Rhythm Issues",
    "A8a. Heart Rhythm Issues Symptoms (Please Select all that apply):": "Palpitations",
    "A8b. Circulation Problems (Please Select all that apply):": "Cold hands and feet",
    "A8c. Blood Pressure-Related (Please Select all that apply):": "Dizziness on standing",
    "A9. Urinary & Reproductive Symptoms (General) (Please Select all that apply):": "Urinary Changes, General Reproductive Symptoms",
    "A9a. Urinary Changes Symptoms (General) (Please Select all that apply):": "Dark or cloudy urine",
    "A9b. General Reproductive Symptoms (General) (Please Select all that apply):": "Irregular menstruation or missed period",
    "A10. Emotional & Psychological  Symptoms (General) (Please Select all that apply):": "Mood Changes, Stress-Related Symptoms",
    "A10a. Mood Changes (General) (Please Select all that apply):": "Irritability",
    "A10b. Behavioral Changes (Please Select all that apply):": "Social withdrawal",
    "A10c. Stress-Related Symptoms (Please Select all that apply):": "Difficulty relaxing",
    "A11. Immune & Infection-Related Symptoms (Please Select all that apply):": "Infection Indicators, Inflammatory Symptoms",
    "A11a. Infection Indicators (Please Select all that apply):": "Recurrent infections",
    "A11b. Inflammatory Symptoms (Please Select all that apply):": "General swelling, Pain with redness",
    "Serious or emergency symptoms that require immediate hospital care.": "- Persistent high fever that does not respond to medication\n- Severe anemia (pale skin, extreme fatigue, shortness of breath)\n- Confusion, disorientation, or coma (cerebral malaria)\n- Seizures\n- Difficulty breathing or rapid breathing (respiratory distress / ARDS)\n- Dark or reduced urine (acute kidney injury / blackwater fever)\n- Persistent vomiting or inability to keep fluids down\n- Jaundice (yellowing of skin and eyes)\n- Severe abdominal pain\n- Shock (low blood pressure, cold extremities, rapid heartbeat)",
    "List the major Causes of malaria.": "- Infection by Plasmodium parasites, including P. falciparum, P. vivax, P. ovale, P. malariae, and P. knowlesi\n\n- Transmission through the bite of an infected female Anopheles mosquito (primary vector)\n\n- Blood transfusion from an infected individual (rare)\n\n- Use of contaminated needles or syringes (rare)\n\n- Congenital transmission from an infected mother to her fetus (rare)",
    "List early/mild cause people usually ignore.": "- Low-level mosquito exposure in endemic areas\n\n- Bites occurring during dawn or dusk, when Anopheles mosquitoes are most active\n\n- Travel to or residence in malaria-endemic regions without prophylactic measures\n\n- Partial immunity or previous infections, which may mask early symptoms\n\n- Neglecting preventive measures such as mosquito nets or repellents",
    "Select the Causes Related to General Causes and If all is Related Select all": "A. HOW MALARIA IS TRANSMITTED, B. MOSQUITO LIFE CYCLE, C. RISK FACTORS",
    "A. HOW MALARIA IS TRANSMITTED (Please Select all that apply):": "A1. Primary Mode of Transmission, A2. The Malaria Parasite, A3. Step-by-Step Transmission Process, A4. Human-to-Mosquito Transmission, A5. Other Less Common Ways Malaria Can Be Transmitted, A6. What Malaria Is NOT Transmitted By, A7. Environmental Factors That Enable Transmission",
    "A1. Primary Mode of Transmission (Please Select all that apply):": "A1.1 Type of Mosquito Involved, A1.2 What Makes a Mosquito Infectious",
    "A1.1 Type of Mosquito Involved (Please Select all that apply):": "Female Anopheles mosquito, Only females transmit malaria because they feed on blood, Not all mosquitoes transmit malaria",
    "A1.2 What Makes a Mosquito Infectious (Please Select all that apply):": "Mosquito becomes infected after biting a person who already has malaria, The parasite develops inside the mosquito before it can infect another person",
    "A2. The Malaria Parasite  (Please Select all that apply):": "A2.1 Common Species That Infect Humans, A2.2 Most Dangerous Species",
    "A2.1 Common Species That Infect Humans  (Please Select all that apply):": "Plasmodium falciparum (most severe and common in Africa), Plasmodium vivax, Plasmodium malariae, Plasmodium ovale, Plasmodium knowlesi",
    "A2.1 Common Species That Infect Humans (Please Select all that apply):": "Plasmodium falciparum",
    "A3. Step-by-Step Transmission Process (Please Select all that apply):": "A3.1 Bite Stage, A3.2 Liver Stage, A3.3 Blood Stage",
    "A3.1 Bite Stage (Please Select all that apply):": "Infected mosquito bites a human, Parasites enter the bloodstream through saliva",
    "A3.2 Liver Stage (Please Select all that apply):": "Parasites travel to the liver, They multiply without causing symptoms at first",
    "A3.3 Blood Stage (Please Select all that apply):": "Parasites leave the liver and infect red blood cells, Red blood cells burst, releasing more parasites, This causes symptoms like fever and chills",
    "B. MOSQUITO LIFE CYCLE (Please Select all that apply):": "Egg, Larva, Pupa, Adult",
    "A4b. Airway Symptoms (Please Select all that apply):__1": "Cough (dry or productive), Wheezing, Chest tightness",
    "A4c. Nasal Symptoms (Please Select all that apply):__1": "If a person with malaria has these nasal symptoms, it usually indicates a coexisting upper respiratory tract infection (e.g., cold, flu, or allergies), not the malaria infection itself.",
    "A5. Gastrointestinal (Digestive) Symptoms (Please Select all that apply):__1": "Stomach Discomfort, Bowel Changes, Appetite Changes",
    "A5a. Stomach Discomfort Symptoms (Please Select all that apply):__1": "Nausea, Vomiting, Bloating",
    "A5b. Bowel Changes Symptoms (Please Select all that apply):__1": "Diarrhea, Constipation, Change in stool color",
    "A5c. Appetite Changes Symptoms (Please Select all that apply):__1": "Loss of appetite",
    "A6. Neurological Symptoms (Please Select all that apply):__1": "Sensory Changes, Cognitive Changes, Motor Issues",
    "A6a. Sensory Changes Symptoms (Please Select all that apply):__1": "Dizziness, Lightheadedness, Tingling or numbness",
    "A6b. Cognitive Changes Symptoms (Please Select all that apply):__1": "Confusion, Difficulty concentrating, Memory issues",
    "A6c. Motor Issues Symptoms (Please Select all that apply):__1": "Tremors, Poor coordination",
    "A7. Skin, Hair & Nail Symptoms (Please Select all that apply):__1": "Skin Changes, Color Changes, Hair & Nails",
    "A7a. Skin Changes Symptoms (Please Select all that apply):__1": "Rashes, Itching, Dry or oily skin",
    "A7b. Color Changes Symptoms (Please Select all that apply):__1": "Pale skin, Yellowing of skin (jaundice)",
    "A7c. Hair & Nail Symptoms (Please Select all that apply):__1": "Hair loss, Brittle nails",
    "A8. Cardiovascular Symptoms (Please Select all that apply):__1": "Heart Rhythm Issues, Circulation Problems, Blood Pressure-Related",
    "A8a. Heart Rhythm Issues Symptoms (Please Select all that apply):__1": "Palpitations, Irregular heartbeat",
    "A8b. Circulation Problems (Please Select all that apply):__1": "Swelling of legs or feet, Cold hands and feet",
    "A8c. Blood Pressure-Related (Please Select all that apply):__1": "Dizziness on standing, Fainting",
    "A9. Urinary & Reproductive Symptoms (General) (Please Select all that apply):__1": "Urinary Changes, General Reproductive Symptoms",
    "A9a. Urinary Changes Symptoms (General) (Please Select all that apply):__1": "Dark or cloudy urine",
    "A9b. General Reproductive Symptoms (General) (Please Select all that apply):__1": "Pelvic discomfort",
    "A10. Emotional & Psychological  Symptoms (General) (Please Select all that apply):__1": "Mood Changes, Behavioral Changes, Stress-Related Symptoms",
    "A10a. Mood Changes (General) (Please Select all that apply):__1": "Anxiety, Irritability, Depression",
    "A10b. Behavioral Changes (Please Select all that apply):__1": "Social withdrawal, Restlessness",
    "A10c. Stress-Related Symptoms (Please Select all that apply):__1": "Difficulty relaxing, Emotional exhaustion",
    "A11. Immune & Infection-Related Symptoms (Please Select all that apply):__1": "Infection Indicators, Inflammatory Symptoms",
    "A11a. Infection Indicators (Please Select all that apply):__1": "Recurrent infections",
    "A11b. Inflammatory Symptoms (Please Select all that apply):__1": "General swelling",
    "Serious or emergency symptoms that require immediate hospital care.__1": "-Persistent high fever unresponsive to medication\n\n- Severe anemia (pale skin, extreme fatigue, shortness of breath)\n\n- Confusion, disorientation, or coma (cerebral malaria)\n\n- Seizures\n\n- Difficulty breathing or rapid breathing (respiratory distress / ARDS)\n\n- Dark or reduced urine (acute kidney injury / blackwater fever)\n\n- Persistent vomiting or inability to retain fluids\n\n- Jaundice (yellowing of skin and eyes)\n\n- Severe abdominal pain\n\n- Shock (low blood pressure, cold extremities, rapid heartbeat)",
    "A. Select the Preventions Related to General Preventions and If all is related, select all": "Use Insecticide-Treated Nets, Indoor Residual Spraying (IRS), Remove Stagnant Water, Use Repellents",
    "A1. Types of Nets (Please Select all that apply):": "Long-Lasting Insecticide-Treated Nets (LLINs), Conventional Treated Nets, Child-sized Nets, Pregnancy-specific Nets",
    "A2. Proper Use of Nets (Please Select all that apply):": "Sleeping Under the Net Every Night, Correct Hanging of Nets (Net fully covering sleeping area) (No gaps or openings), Tucking Nets Properly Under Mattress or Mat",
    "A3. Net Maintenance (Please Select all that apply):": "Washing Guidelines, Drying Practices, Repairing Damaged Nets",
    "A3a. Washing Guidelines (Please Select all that apply):": "Frequency of washing, Approved detergents",
    "A3b. Drying Practices (Please Select all that apply):": "Drying in shade, Avoiding direct sunlight",
    "A3c. Repairing Damaged Nets (Please Select all that apply):": "Stitching holes, Replacing torn nets",
    "A4. Target Users (Please Select all that apply):": "Children under five, Pregnant women, Elderly individuals",
    "B. Indoor Residual Spraying (IRS)  (Please Select all that apply):": "What Indoor Residual Spraying Is, Areas to Spray, Spraying Frequency, Safety Measures, Responsibility & Support",
    "B1. What Indoor Residual Spraying Is  (Please Select all that apply):": "Spraying insecticides on indoor walls, Targeting mosquito resting surfaces",
    "B2. Areas to Spray (Please Select all that apply):": "Bedroom walls, Living room walls, Dark corners and ceilings, Animal shelters close to homes",
    "B3. Spraying Frequency (Please Select all that apply):": "Seasonal spraying, Periodic re-spraying, Government-recommended intervals",
    "B4. Safety Measures (Please Select all that apply):": "Keeping people outside during spraying, Protecting food and water sources, Re-entry time after spraying",
    "B5. Responsibility & Support (Please Select all that apply):": "Government-led spraying programs, Community-based spraying, Trained professionals only",
    "C. Remove Stagnant Water (Please Select all that apply):": "Common Sources of Stagnant Water, Household Actions, Environmental Management, Community Participation",
    "C1. Common Sources of Stagnant Water (Please Select all that apply):": "Open containers, Buckets and barrels, Old tyres, Flower pots and trays",
    "C2. Household Actions (Please Select all that apply):": "Emptying containers regularly, Covering water storage containers, Cleaning gutters and drains",
    "C3. Environmental Management (Please Select all that apply):": "Filling potholes and depressions, Clearing bushes around homes, Improving drainage systems",
    "C4. Community Participation (Please Select all that apply):": "Community clean-up exercises, Environmental sanitation days, Reporting mosquito breeding sites",
    "D. Use Repellents (Please Select all that apply):": "Types of Repellents, Proper Application, Special Groups, Additional Protective Measures",
    "D1. Types of Repellents (Please Select all that apply):": "Topical repellents (creams, lotions), Sprays, Repellent coils, Electric vaporizers, Repellent candles",
    "D2. Proper Application(Please Select all that apply):": "Applying on exposed skin, Avoiding eyes, mouth, and wounds, Re-application intervals",
    "D3. Special Groups (Please Select all that apply):": "Use in children, Use during pregnancy, Use for sensitive skin",
    "D4. Additional Protective Measures (Please Select all that apply):": "Wearing long-sleeved clothing, Using repellents outdoors and indoors, Combining repellents with nets",
    "What are the most effective malaria prevention methods?": "- Use of Long-Lasting Insecticide-Treated Nets (LLINs) – sleeping under treated nets every night provides continuous protection from mosquito bites.\n\n- Indoor Residual Spraying (IRS) – applying insecticides to walls and surfaces inside homes to kill mosquitoes.\n\n- Elimination of mosquito breeding sites – removing stagnant water from containers, drains, and surroundings to reduce mosquito populations.\n\n- Use of mosquito repellents – applying repellents to exposed skin or clothing to prevent bites.\n\n- Preventive antimalarial medications (chemoprophylaxis) – especially for travelers to malaria-endemic regions or high-risk individuals (e.g., pregnant women).\n\n- Protective clothing – wearing long sleeves and pants, particularly during dusk and dawn when Anopheles mosquitoes are most active.",
    "What are verified preventive measures (nets, repellants, environment hygiene, etc.)?   [Row 1]": "Column 1",
    "Common prevention mistakes people make.": "- Inconsistent or improper use of mosquito nets – not sleeping under the net every night, leaving gaps, or not tucking it properly.\n\n- Ignoring net maintenance – washing with harsh detergents, drying in direct sunlight, or failing to repair holes.\n\n- Neglecting indoor residual spraying (IRS) – skipping scheduled sprays or using ineffective products.\n\n- Failing to eliminate mosquito breeding sites – leaving stagnant water around homes, in containers, or drains.\n\n- Not using repellents or protective clothing – especially during peak mosquito activity at dusk and dawn.\n\n- Delayed or no chemoprophylaxis – travelers or high-risk individuals not taking preventive medications.\n\n- Relying solely on one method – e.g., only using nets but ignoring environmental control or repellents.\n\n- Misconceptions about malaria prevention – believing malaria is caused by dirty water, casual contact, or food, leading to neglect of proper measures.",
    "How is malaria properly diagnosed?": "- Microscopic blood smear (thick and thin smears) – gold standard\n\n- Rapid Diagnostic Tests (RDTs) – detect malaria antigens quickly\n\n- PCR tests – highly sensitive, mainly for research or complex cases",
    "What diagnostic tests are available and what users should know about them?": "Malaria is diagnosed through tests that detect the presence of the Plasmodium parasite or its proteins in the blood. The two main diagnostic methods are \nMicroscopy (blood smear) \nRapid Diagnostic Tests (RDTs). Because malaria can become life-threatening rapidly, prompt diagnosis is critical for treatment.",
    "A. Select the Preventions Related to General Preventions and If all is related, select all__1": "A. What Drugs Are Used?, B. Where to Test?, C. When to Seek Emergency Care, D. Follow-Up After Treatment",
    "A. What Drugs Are Used?   (Please Select all that apply):": "A1. First-Line Antimalarial Drugs, A2. Drugs for Severe Malaria, A4. Supportive Medications, A5. Important Drug Use Guidelines",
    "A1. First-Line Antimalarial Drugs(Please Select all that apply):": "A1a. Artemisinin-based Combination Therapies (ACTs), A1b. Use for uncomplicated malaria, A1c. Oral medications",
    "A1a. Artemisinin-based Combination Therapies (ACTs)(Please Select all that apply):": "Artemether–Lumefantrine",
    "A2. Drugs for Severe Malaria (Please Select all that apply):": "A2a. Injectable antimalarials, A2b. Used in hospital settings, A2c. Followed by oral ACTs",
    "A2a. Injectable antimalarials (Please Select all that apply)": "Artesunate (injection)",
    "A3. Drugs for Special Groups (Please Select all that apply)": "A3a. Treatment during pregnancy, A3b. Treatment for children, A3c. Treatment for breastfeeding mothers",
    "A3a. Treatment during pregnancy (Please Select all that apply)": "First trimester options, Second and third trimester options",
    "A3b. Treatment for children (Please Select all that apply)": "Child-friendly formulations, Weight-appropriate medications",
    "A4. Supportive Medications (Please Select all that apply)": "A4a. Fever reducers, A4b. Pain relief medications, A4c. Treatment for anemia (if present), A4d. Fluids for dehydration",
    "A5. Important Drug Use Guidelines (Please Select all that apply)": "A5a. Completing the full dose, A5b. Avoiding self-medication, A5c. Not sharing medications, A5d. Avoiding expired drugs",
    "B. Where to Test? (Please Select all that apply)": "B1. Health Facilities, B2. Private Health Centers, B3. Community-Based Testing, B4. Types of Tests Available, B5. Why Testing Is Important",
    "B1. Health Facilities(Please Select all that apply)": "B1a. Government hospitals, B1b. Teaching hospitals, B1c. Primary health care centers",
    "B2. Private Health Centers (Please Select all that apply)": "B2a. Private hospitals, B2b. Registered clinics, B2c. Diagnostic laboratories",
    "B3. Community-Based Testing (Please Select all that apply)": "B3a. Community health workers, B3b. Outreach medical programs, B3c. Mobile clinics",
    "B4. Types of Tests Available (Please Select all that apply)": "B4a. Rapid Diagnostic Test (RDT), B4b. Blood smear microscopy, B4c. Laboratory confirmation tests",
    "B5. Why Testing Is Important (Please Select all that apply)": "B5a. Confirms the disease, B5b. Prevents wrong treatment, B5c. Reduces drug resistance, B5d. Guides correct care",
    "C. When to Seek Emergency Care (Please Select all that apply)": "C1. Severe Physical Symptoms, C2. Neurological Warning Signs, C3. Gastrointestinal Danger Signs, C4. High-Risk Groups, C5. Action to Take",
    "C1. Severe Physical Symptoms (Please Select all that apply)": "C1a. Persistent high fever, C1b. Severe weakness or collapse, C1c. Difficulty breathing",
    "C2. Neurological Warning Signs (Please Select all that apply)": "C2a. Confusion or altered awareness, C2b. Convulsions or seizures, C2c. Loss of consciousness",
    "C3. Gastrointestinal Danger Signs (Please Select all that apply)": "C3a. Repeated vomiting, C3b. Inability to eat or drink, C3c. Severe abdominal pain",
    "C4. High-Risk Groups (Please Select all that apply)": "C4a. Children under five, C4b. Pregnant women, C4c. Elderly persons, C4d. People with chronic illnesses",
    "C5. Action to Take (Please Select all that apply)": "C5a. Go to nearest hospital immediately, C5b. Avoid home treatment delays, C5c. Inform health workers of symptoms",
    "D. Follow-Up After Treatment (Please Select all that apply)": "D1. Monitoring Recovery, D2. Follow-Up Testing, D3. Preventing Re-infection, D4. Managing Side Effects, D5. Health Education",
    "Recommended malaria treatments for adults.": "Uncomplicated P. falciparum: Artemisinin-based combination therapy (ACT) – e.g., Artemether–lumefantrine for 3 days.\n\nUncomplicated P. vivax/ovale: Chloroquine + Primaquine (if G6PD normal).\n\nSevere malaria: IV Artesunate, then oral ACT when stable.\nSupportive care: Paracetamol for fever, fluids, monitor complications.",
    "Recommended treatments for children.": "Uncomplicated malaria: ACT (e.g., artemether–lumefantrine) – dose by weight.\nP. vivax/ovale: Chloroquine + primaquine (if G6PD normal).\n\nSevere malaria: IV artesunate, then oral ACT when stable.\n\nSupportive care: Fever relief, fluids, monitor closely.",
    "Drug guidelines (dosage ranges, usage rules, what NOT to do).": "Finish full course of ACT or chloroquine (with primaquine for relapse), use hospital IV for severe cases, never stop early, avoid resistance areas and G6PD risk.",
    "What treatments should never be used? (Common dangerous practices).": "Artemisinin alone, incomplete courses, self-medication, untested primaquine, home treatment for severe malaria, chloroquine in resistant areas, or mixing drugs without guidance.",
    "A. Select the Pragnancy Enquiry Needed and Related to Malaria cases and If all is related, select all": "A. Is It Risky?, B. Safe Drugs in Pregnancy, C. Prevention for Pregnant Women, D. When to See a Clinician",
    "A. Is It Risky?   (Please Select all that apply)": "A1. Why Pregnancy Increases Risk, A2. Risks to the Mother, A3. Risks to the Baby, A4. Risk by Pregnancy Stage, A5. Importance of Early Care",
    "A1. Why Pregnancy Increases Risk   (Please Select all that apply)": "A1a. Reduced immunity during pregnancy, A1b. Increased susceptibility to infections, A1c. Higher parasite load in pregnancy",
    "A2. Risks to the Mother (Please Select all that apply)": "A2a. Severe anemia, A2b. High fever and weakness, A2c. Increased risk of severe illness, A2d. Complications during delivery",
    "A3. Risks to the Baby (Please Select all that apply)": "A3a. Low birth weight, A3b. Premature birth, A3c. Stillbirth, A3d. Poor fetal growth",
    "A4. Risk by Pregnancy Stage (Please Select all that apply)": "A4a. First trimester risks, A4b. Second trimester risks, A4c. Third trimester risks",
    "A5. Importance of Early Care (Please Select all that apply)": "A5a. Early testing, A5b. Prompt treatment, A5c. Regular antenatal visits",
    "B. Safe Drugs in Pregnancy (Please Select all that apply)": "B1. General Treatment Principles, B2. First Trimester (Early Pregnancy), B3. Second and Third Trimesters, B4. Drugs to Avoid, B5. Managing Side Effects",
    "B1. General Treatment Principles (Please Select all that apply)": "B1a. Only use clinician-approved drugs, B1b. Avoid self-medication, B1c. Use trimester-appropriate treatment",
    "B2. First Trimester (Early Pregnancy) (Please Select all that apply)": "B2a. Recommended medications by health professionals, B2b. Avoid certain antimalarial drugs, B2c. Close medical supervision required",
    "B3. Second and Third Trimesters (Please Select all that apply)": "B3a. Approved antimalarial medications, B3b. Oral treatments preferred when possible, B3c. Hospital care for severe cases",
    "B4. Drugs to Avoid (Please Select all that apply)": "B4a. Non-approved medications, B4b. Herbal or traditional remedies without approval, B4c. Expired or shared drugs",
    "B5. Managing Side Effects (Please Select all that apply)": "B5a. Mild side effects, B5b. When to report reactions, B5c. Importance of completing treatment",
    "C. Prevention for Pregnant Women (Please Select all that apply)": "C1. Use of Insecticide-Treated Nets, C2. Preventive Medication (Intermittent Preventive Treatment), C3. Environmental Protection, C4. Personal Protection, C5. Antenatal Care Practices",
    "C1. Use of Insecticide-Treated Nets (Please Select all that apply)": "C1a. Sleeping under nets every night, C1b. Proper hanging and maintenance, C1c. Priority access for pregnant women",
    "C2. Preventive Medication (Intermittent Preventive Treatment) (Please Select all that apply)": "C2a. Preventive drugs during antenatal care, C2b. Scheduled doses as recommended, C2c. Importance of compliance",
    "C3. Environmental Protection (Please Select all that apply)": "C3a. Removing stagnant water, C3b. Keeping surroundings clean, C3c. Clearing bushes near homes",
    "C4. Personal Protection  (Please Select all that apply)": "C4a. Wearing protective clothing, C4b. Use of safe repellents, C4c. Avoiding mosquito exposure at night",
    "C5. Antenatal Care Practices  (Please Select all that apply)": "C5a. Regular clinic attendance, C5b. Health education during visits, C5c. Early reporting of symptoms",
    "D. When to See a Clinician (Please Select all that apply)": "D1. Early Warning Symptoms, D2. Danger Signs, D3. After Exposure or Risk, D4. Follow-Up Visits",
    "D1. Early Warning Symptoms (Please Select all that apply)": "D1a. Fever during pregnancy, D1b. Persistent headache, D1c. Body weakness or fatigue",
    "D2. Danger Signs (Please Select all that apply)": "D2a. Severe vomiting, D2b. Reduced fetal movement, D2c. Vaginal bleeding, D2d. Severe abdominal pain",
    "D3. After Exposure or Risk  (Please Select all that apply)": "D3a. Recent mosquito exposure with symptoms, D3b. Living in high-risk areas, D3c. Missed preventive medication",
    "D4. Follow-Up Visits (Please Select all that apply)": "D4a. After completing treatment, D4b. If symptoms return, D4c. Routine antenatal follow-up",
    "A. Select all Malaria related Information in childredn and If all is related, select all": "A. Why Children Are Vulnerable, B. Signs in Children, C. When to Bring Child to Clinic, D. Prevention for Children",
    "A. Why Children Are Vulnerable  (Please Select all that apply)": "A1. Immature Immune System, A2. Higher Exposure to Mosquito Bites, A3. Nutritional Factors, A4. Limited Ability to Communicate Symptoms, A5. Age-Specific Risk Groups",
    "A1. Immature Immune System  (Please Select all that apply)": "A1a. Body defenses not fully developed, A1b. Reduced ability to fight infections, A1c. Higher risk of severe illness",
    "A2. Higher Exposure to Mosquito Bites (Please Select all that apply)": "A2a. Playing outdoors in the evening, A2b. Sleeping without protective nets, A2c. Poor environmental protection",
    "A3. Nutritional Factors (Please Select all that apply)": "A3a. Malnutrition, A3b. Iron deficiency and anemia, A3c. Weakened resistance to disease",
    "A4. Limited Ability to Communicate Symptoms (Please Select all that apply)": "A4a. Inability to describe pain or discomfort, A4b. Delayed detection of illness, A4c. Dependence on caregivers for care",
    "A5. Age-Specific Risk Groups (Please Select all that apply)": "A5a. Infants, A5b. Children under five years, A5c. School-age children",
    "B. Signs in Children (Please Select all that apply)": "B1. General Physical Signs, B2. Behavioral Changes, B3. Digestive Symptoms, B4. Drugs to Avoid, B5. Signs in Infants",
    "B1. General Physical Signs (Please Select all that apply)": "B1a. Fever, B1c. Loss of appetite",
    "B2. Behavioral Changes (Please Select all that apply)": "B2a. Excessive crying, B2b. Irritability, B2c. Unusual sleepiness",
    "B3. Digestive Symptoms (Please Select all that apply)": "B3a. Vomiting, B3b. Diarrhea, B3c. Refusal to eat or drink",
    "B4. Severe or Warning Signs (Please Select all that apply)": "B4a. Convulsions, B4b. Difficulty breathing, B4c. Pale or yellowish skin, B4d. Inability to sit, stand, or walk",
    "B5. Signs in Infants (Please Select all that apply)": "B5a. Poor feeding, B5b. High-pitched crying, B5c. Bulging soft spot on the head, B5d. Reduced movement",
    "C. When to Bring Child to Clinic (Please Select all that apply)": "C1. Immediately (Emergency), C2. Within 24 Hours, C3. After Home Observation, C4. High-Risk Children",
    "C1. Immediately (Emergency)  (Please Select all that apply)": "C1a. High fever not reducing, C1b. Convulsions or seizures, C1c. Loss of consciousness, C1d. Difficulty breathing",
    "C2. Within 24 Hours (Please Select all that apply)": "C2a. Fever lasting more than one day, C2b. Persistent vomiting or diarrhea, C2c. Refusal to eat or drink",
    "C3. After Home Observation  (Please Select all that apply)": "C3a. Symptoms not improving, C3b. Child becoming weaker, C3c. Symptoms returning after treatment",
    "C4. High-Risk Children  (Please Select all that apply)": "C4a. Children under five years, C4b. Malnourished children, C4c. Children with chronic illness",
    "D. Prevention for Children (Please Select all that apply)": "D1. Use of Insecticide-Treated Nets, D2. Environmental Protection, D3. Personal Protection, D4. Health-Seeking Practices",
    "D1. Use of Insecticide-Treated Nets  (Please Select all that apply)": "D1a. Sleeping under nets every night, D1b. Child-appropriate net size, D1c. Ensuring no gaps or holes",
    "D2. Environmental Protection (Please Select all that apply)": "D2a. Removing stagnant water around home, D2b. Clearing bushes and gutters, D2c. Proper waste disposal",
    "D3. Personal Protection (Please Select all that apply)": "D3a. Wearing long-sleeved clothing in evenings, D3b. Using child-safe repellents, D3c. Avoiding outdoor exposure at night",
    "D4. Health-Seeking Practices (Please Select all that apply)": "D4a. Early testing when symptoms appear, D4b. Completing prescribed treatment, D4c. Regular health check-ups",
    "D5. Caregiver Education (Please Select all that apply)": "D5a. Recognizing early signs, D5b. Knowing danger signs, D5c. Avoiding self-medication",
    "Possible complications of untreated malaria.": "- Severe anemia\n- Cerebral malaria / brain swelling\n- Kidney failure\n- Respiratory distress / pulmonary edema\n- Hypoglycemia (low blood sugar)\nSepticemia / secondary infections\n- Organ failure (liver, spleen)\n- Death",
    "High-risk groups (pregnant women, children, elderly) and what applies to them.": "Pregnant women: more severe malaria, risk to mother and baby → focus on prevention and safe drugs.\n\nChildren <5: fast progression, severe anemia, cerebral malaria → focus on early treatment and nets.\n\nElderly: weaker immunity, chronic illness → focus on early detection and supportive care.",
    "Common myths or false beliefs about malaria.": "- Malaria is caused by eating bad food.\n\n- Only dirty water spreads malaria.\n\n- Cold weather prevents malaria.\n\n- Bed nets are unnecessary.\n\n- Herbal remedies alone can cure malaria.",
    "Clear medical corrections for each myth.": "Bad food: Caused by mosquito bites.\nDirty water: Spread only by infected mosquitoes.\nCold weather: Doesn’t fully prevent malaria.\nBed nets unnecessary: Nets effectively prevent bites.\nHerbs cure malaria: Only antimalarial drugs work.",
    "What should Yoruba-speaking communities particularly know about malaria?": "- Malaria is from mosquito bites, not bad food or dirty water.\n- High-risk groups: Pregnant women, children under 5, and the elderly.\nSymptoms: Fever, chills, headache, fatigue, nausea.\n- Prevention: Use insecticide-treated bed nets, remove standing water, wear protective clothing, seek early care.\n- Treatment: Only approved antimalarial drugs work; complete the full course.\n- Danger of myths: Herbal remedies or skipping medicine can be fatal.\nPregnancy warning: Malaria can harm mother and baby; early care and safe drugs are essential.",
    "Cultural practices or beliefs that affect malaria prevention or treatment.": "Belief that malaria comes from bad food or cold weather, leading to delayed treatment.\n\nPreference for herbal remedies instead of formal medicine.\n\nReluctance to use bed nets due to heat, discomfort, or superstition.\n\nTraditional pregnancy practices that delay seeking medical care.\n\nSelf-medication with leftover drugs instead of visiting a clinic.",
    "Any additional important malaria-related information you believe the system should include.": "Malaria can become severe quickly; early recognition saves lives.\n\nRapid diagnostic tests (RDTs) and blood smears are key for accurate diagnosis.\n\nDrug resistance is a growing problem—always use recommended therapies.\n\nPregnant women and children should have priority access to prevention and care.\n\nSeasonal spikes occur; increased vigilance during rainy seasons is crucial.\n\nCommunity awareness and prompt treatment reduce transmission.",
    "1. Any additional important malaria-related documents and files you believe the system should include.": "",
    "2. Any additional important malaria-related documents and files you believe the system should include.": "",
    "Any additional important malaria-related audio files you believe the system should include.": "",
    "Any additional important malaria-related Video files you believe the system should include.": ""
  }
]